In [326]:
import pandas as pd

In [327]:
companies = {
    'Value': [220, 160, 140, 117, 94],
    'Change': [17.5, 11.9, -8.5, -2.1, 3.5],
    'Sector': ['Retail', 'Tech', 'Tech', 'Tech', 'Tech']
}

data = pd.DataFrame(companies, index=['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'])
data

           Value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [328]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsung
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Value   5 non-null      int64
 1   Change  5 non-null      float64
 2   Sector  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [329]:
data.columns

Index(['Value', 'Change', 'Sector'], dtype='object')

In [330]:
data.index

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'], dtype='object')

In [331]:
data.describe()

            Value     Change
count    5.000000   5.000000
mean   146.200000   4.460000
std     48.095738  10.456003
min     94.000000  -8.500000
25%    117.000000  -2.100000
50%    140.000000   3.500000
75%    160.000000  11.900000
max    220.000000  17.500000

In [332]:
data.loc[data['Value'] > 150]       #Only show companies that have its values > 150 M

        Value  Change  Sector
Amazon    220    17.5  Retail
Google    160    11.9    Tech

In [333]:
data

           Value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [334]:
data.iloc[3]        # select row index of 3, which is Microsoft

Value      117
Change    -2.1
Sector    Tech
Name: Microsoft, dtype: object

In [335]:
# slicing
data.iloc[1:4, 1:3]
#  [row:row, col:col]

           Change Sector
Google       11.9   Tech
Apple        -8.5   Tech
Microsoft    -2.1   Tech

In [336]:
# number slicing
# Only row 0 to row 2
data[0:3]

        Value  Change  Sector
Amazon    220    17.5  Retail
Google    160    11.9    Tech
Apple     140    -8.5    Tech

In [337]:
# string slicing
# Returns data from Amaazon row to Microsoft row
data['Amazon':'Microsoft']

           Value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech

In [338]:
data

           Value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [339]:
# multiply
data['Value'].mul(2)

Amazon       440
Google       320
Apple        280
Microsoft    234
Samsung      188
Name: Value, dtype: int64

In [340]:
# subtract
data['Value'].sub(2)

Amazon       218
Google       158
Apple        138
Microsoft    115
Samsung       92
Name: Value, dtype: int64

In [341]:
# add
data['Value'].add(2)

Amazon       222
Google       162
Apple        142
Microsoft    119
Samsung       96
Name: Value, dtype: int64

In [342]:
# div and mod values in 'Value col by 2
# div is the floor of each value divided by 2
# rem is the remainder of each value divided by 2
div, rem = divmod(data['Value'], 2)
div, rem

(Amazon       110
 Google        80
 Apple         70
 Microsoft     58
 Samsung       47
 Name: Value, dtype: int64,
 Amazon       0
 Google       0
 Apple        0
 Microsoft    1
 Samsung      0
 Name: Value, dtype: int64)

In [343]:
data

           Value  Change  Sector
Amazon       220    17.5  Retail
Google       160    11.9    Tech
Apple        140    -8.5    Tech
Microsoft    117    -2.1    Tech
Samsung       94     3.5    Tech

In [344]:
# Calculate mean (avereage) of numerical data
data.mean()

Value     146.20
Change      4.46
dtype: float64

In [345]:
# Sum values for each column
# sum(0)<default> - sum values for each column
data.sum(0)

Value                        731
Change                      22.3
Sector    RetailTechTechTechTech
dtype: object

In [346]:
# sum values for each index (row)
data.sum(1)

Amazon       237.5
Google       171.9
Apple        131.5
Microsoft    114.9
Samsung       97.5
dtype: float64

In [347]:
# returns the Bressel standard deviation of the numerical columns
data.std()

Value     48.095738
Change    10.456003
dtype: float64

In [348]:
# (0-1 interval), this case is 50% quantile
data.quantile(.5)

Value     140.0
Change      3.5
Name: 0.5, dtype: float64

In [349]:
# returns minimum of each column
data.min()

Value         94
Change      -8.5
Sector    Retail
dtype: object

In [350]:
#returns cumllative sum over a DataFrame or series axis
data.cumsum()

           Value  Change                  Sector
Amazon       220    17.5                  Retail
Google       380    29.4              RetailTech
Apple        520    20.9          RetailTechTech
Microsoft    637    18.8      RetailTechTechTech
Samsung      731    22.3  RetailTechTechTechTech

In [351]:
# number of non-null values
data.count()

Value     5
Change    5
Sector    5
dtype: int64